import unittest
import print_table
import generate_files

row = {
    "name": "Системный аналитик (Senior)",
    "description": "<p>Здравствуйте, уважаемые Системные аналитики!</p> <p><em>Резидент СКОЛКОВО, Аккредитованная МинЦифрой РФ - ИТ компания.</em></p> <p><em>В вакансии много текста, но все по делу (старайтесь не откликаться без сопроводительного письма)!</em></p> <ul> <li>В <em><strong>мае 2022 </strong></em>года<em><strong> </strong></em>получили статус партнера <strong>Оператора ФНС</strong> по работе с налогом на профессиональный доход</li> <li>В <em><strong>феврале 2022 </strong></em>года получили статус резидента инновационного центра <strong>Сколково</strong>, вошли в ассоциации АРПП, АПКИТ, получили патент на свою разработку</li> <li>В <strong><em>декабре 2021</em></strong> года готов базовый функционал 3 мобильных приложений, веб сайта, веб портала (личный кабинет аутсорсинговой компании), подали заявки на регистрации программ в Роспатент</li> <li>В <strong><em>июле 2021</em></strong> года существенно расширили функционал и запустили продукт в коммерческую эксплуатацию</li> <li>В <em><strong>январе 2021</strong></em> года запустили пилот, подали заявку на партнерство с ФНС РФ и резидентство в Сколково</li> <li>В <em><strong>октябре 2020</strong></em> получили статус резидента Бизнес-инкубатора Ингрия и запустили альфа версии мобильных приложений и сайта</li> </ul> <p>Обязательно прочитайте информацию о Компании перед тем, как откликаться на данную вакансию, это важно! Проект достаточно сложный и масштабный (и это не просто слова). Создаем Цифрового двойника Аутсорсинговых компаний с использованием Искусственного интеллекта и Машинного обучения (Outsourcing Company Digital Twin - Gartner Hype Cycle for Emergind Technologies 2021, AI&amp;ML). Аналогичных проектов пока нет на российском рынке, но есть на западных. Не считаем себя уникальными, но все факты говорят именно об этом – готовы подробнее рассказать на интервью. С уважением к Вам и вашему времени.</p> <p><strong>Цель</strong><strong> HR-tech </strong><strong>проекта</strong><strong>:</strong></p> <p>В результате COVID-19, многие жители РФ остались без работы и в сложной экономической ситуации, при которой найти нормальную работу и сделать это быстро они не смогут. В крупных городах проблема менее заметна, но в городах менее 1 млн населения и отдаленных районах такая проблема ярко выражена. Для нас крайне важно оказать реальную поддержку населению страны, оказавшимся без работы и нуждающихся в деньгах.</p> <p>Мы разрабатываем цифровую аутсорсинг платформу по трудоустройству линейного персонала («синие воротнички», не путать с белыми!), которая позволит по-новому взглянуть на процессы взаимодействия корпоративных клиентов и исполнителей. Сервис поможет бизнесу найти исполнителя, а человеку – любимую работу и компанию мечты. Диджитализация, уберизация и создание уникальных конкурентных преимуществ на рынке – вот три основные задачи, которые решает команда на пути реализации проекта, реализуемого за 3 фазы.</p> <p><strong>На какой мы стадии</strong></p> <ul> <li><em><strong>--&gt; Расширяем функционал продукта, подключаем коммерческих клиентов &lt;--</strong></em></li> <li>Собрана команда, открыто финансирование по проекту</li> <li>Разработан дизайн проект, UI-кит и дизайн система</li> <li>58ый спринт ИТ разработки (2х недельные спринты)</li> <li><em><strong>Разработаны мобильные приложения для iOS, Android, Huawei</strong></em></li> <li><em><strong>Разработан web сайт и консоль администратора</strong></em></li> <li>Развернули кластерную инфраструктуру и заставили работать 12 приложений и 26 микросервисов как единое целое</li> <li><em><strong>Пережили 2 года: не развалились, не закрылись, не разорились, перенесли pivot, не выгорели, а в 2021 году увеличили штат почти в 4 раза</strong></em></li> </ul> <p><strong>Что предлагаем:</strong></p> <ul> <li>3 дня в офисе, 2 дня удаленно</li> <li>Команда, нацеленная на общий результат и интересные задачи по ходу превращения проекта в MVP, а затем в полноценный продукт</li> <li>Руководители, которые работают с Вами как с партнерами, могут передать опыт и помочь, а не просто ставить Вам задачи и контролировать их исполнение</li> <li>Готовность к открытому диалогу с целью индивидуального обсуждения с каждым кандидатом зарплатных ожиданий и условий работы</li> <li>Офис класса В+ в престижном районе Москве с панорамными окнами (команды: дизайнеры, аналитики, тестировщики маркетинг, продажи, операционисты)</li> <li>Производительный <strong>Ультрабук Asus 2021 года </strong>для комфортной работы</li> <li>На 100% честное трудоустройство, никаких задержек выплат з/п, регулярная индексация (не менее 2х раз в год) и бонусы</li> <li>Дух стартапа и стабильность крупной компании</li> </ul> <p><strong>Ожидания от Системного аналитика:</strong></p> <ul> <li> <p>Опыт работы на позиции системного аналитика в сфере IT от 3 лет;</p> </li> <li> <p>Хорошее знание принципов разработки программного обеспечения (проектирование, планирование, разработка, тестирование, доработки);</p> </li> <li> <p>Навыки работы с документацией, как продуктовой, так и технической. Понимание документации API;</p> </li> <li> <p>Опыт работы в проектах с микросервисной архитектурой;</p> </li> <li> <p>Понимание синхронного и асинхронного взаимодействия микросервисов (общие знания про http и любой брокер сообщений);</p> </li> <li> <p>Умение писать запросы на SQL (понимание и умение выборки из связей многие ко многим будет плюсом);</p> </li> <li> <p>Знание нотации BPMN, UML и опыт описания REST API;</p> </li> <li> <p>Умение писать запросы к MongoDB будет плюсом.</p> </li> </ul> <p><strong>Основные задачи Системного аналитика:</strong></p> <ul> <li> <p>Проработка сценариев взаимодействия сервисов при реализации бизнес-функциональности;</p> </li> <li> <p>Погружение и проработка бизнес-процессов;</p> </li> <li> <p>Сбор и формирование требований к системе;</p> </li> <li> <p>Формирование вариантов возможной технической реализации решения;</p> </li> <li> <p>Разработка и согласование функциональных и технических спецификаций;</p> </li> <li> <p>Коммуникации с разработчиками для эффективной реализации задач;</p> </li> <li> <p>Управление релизом ПО.</p> </li> </ul> <p><strong>Обратная связь</strong></p> <p>Мы ценим время друг друга и оперативно даем обратную связь КАЖДОМУ участнику, который откликнется на вакансию. Финальное решение будет после двух собеседований (15 минут + 45 минут)</p> <p><strong>Отклики с сопроводительным письмом (почему Вам было бы интересно присоединиться к проекту и команде) и указанием зарплатных ожиданий будут для нас крайне важны и приоритетны</strong></p>",
    "key_skills": ["UML", "SQL", "MongoDB", "BPMN"],
    "experience_id": "between3And6",
    "premium": "TRUE",
    "employer_name": "Прoект",
    "salary_from": "45000",
    "salary_to": "45000",
    "salary_gross": "Да",
    "salary_currency": "RUR",
    "area_name": "Москва",
    "published_at": "2022-07-13T11:03:58+0300",
}


class InputConnectTestCase(unittest.TestCase):
    def test_formatter_salary(self):
        test_vac = print_table.Vacancy(row)
        print_table.InputConnect.formatter(test_vac)
        self.assertEqual(test_vac.salary, "45 000 - 45 000 (Рубли) (Без вычета налогов)")

    def test_formatter_published_at(self):
        test_vac = print_table.Vacancy(row)
        print_table.InputConnect.formatter(test_vac)
        self.assertEqual(test_vac.published_at, "13.07.2022")

    def test_formatter_key_skills(self):
        test_vac = print_table.Vacancy(row)
        print_table.InputConnect.formatter(test_vac)
        self.assertEqual(test_vac.key_skills, "UML\nSQL\nMongoDB\nBPMN")

    def test_formatter_description(self):
        test_vac = print_table.Vacancy(row)
        print_table.InputConnect.formatter(test_vac)
        self.assertEqual(test_vac.description,
                         "<p>Здравствуйте, уважаемые Системные аналитики!</p> <p><em>Резидент СКОЛКОВО, Аккредитованная МинЦиф...")

    def test_filter_table(self):
        params = print_table.InputConnect()
        vacancies = print_table.DataSet("vacancies.csv")
        params.filter_dict = ["Название", "Инженер - механик / Начинающий Специалист"]
        a = params.filter_table(vacancies.vacancies_objects)
        self.assertEqual(len(a), 3)

    def test_fill_years(self):
        a = print_table.DataSet.parse_row("vacancies.csv")
        b = generate_files.InputConnect.fill_years(a, set())
        self.assertEqual(len(b), 2)
    def test_prepare_vacs_by_cities(self):
        a = print_table.DataSet.parse_row("vacancies.csv")
        b = generate_files.InputConnect.prepare_vacs_by_cities(a,{"Новочеркасск":2,"Москва":1})
        self.assertEqual(b,{'Новочеркасск': 0.6667, 'Москва': 0.3333})


class DataSetTestCase(unittest.TestCase):
    def test_parse_row_regex(self):
        a = print_table.DataSet.parse_row("vacancies.csv")
        self.assertNotRegex(a[0].description, r'\<[^>]*\>')

    def test_parse_row_skills(self):
        a = print_table.DataSet.parse_row("vacancies.csv")
        self.assertEqual(len(a[0].key_skills), 2)

    def test_parse_row_name(self):
        a = print_table.DataSet.parse_row("vacancies.csv")
        self.assertEqual(a[0].name, "Инженер - механик / Начинающий Специалист")


if __name__ == '__main__':
    unittest.main()
